{
  "symbol": "AMAL",
  "filing_url": "https://www.sec.gov/Archives/edgar/data/1823608/000182360824000076/amal-20231231.htm",
  "business_overview": {
    "business_description": "Amalgamated Financial Corp. operates as a bank holding company, with Amalgamated Bank as its sole subsidiary. The bank offers a range of commercial and retail banking services, including lending, deposit products, and trust/investment management tailored to socially responsible organizations, unions, non-profits, and values-oriented businesses and individuals nationwide. They are committed to Environmental, Social, and Governance (ESG) standards, focusing on impact banking and lending services to customers who value social change. The company is a certified B Corporation and a member of the Global Alliance for Banking on Values.",
    "revenue_model": "The company generates revenue through net interest income, which stems from the difference between interest earned on assets like loans and securities, and interest paid on liabilities, such as deposits and borrowings. It also earns non-interest income from trust and investment management fees, service charges on deposit accounts, and gains or losses on sales of investment securities. The business model focuses on gathering deposits from values-based commercial clients and customers, providing trust, custody, and investment management services to grow fee income, and deploying excess liquidity through a conservative asset allocation strategy.",
    "strategic_direction": "The company's strategic direction is centered around being America’s socially responsible bank, empowering organizations and individuals to advance positive social change through impact banking and lending services to a customer base that cares about how their money is invested. The company also plans to develop organic relationships with its target customer base in existing markets and expand strategically into new geographies. The company has committed to Net Zero emissions in their loan portfolio by 2045.",
    "long_term_goals": "The long-term goals include focusing on deposit-led organic growth, expanding geographically into new markets, growing the Trust and Investment Management business, and maintaining a prudent approach to asset allocation. The company aims to enhance its franchise value by growing organically, continuing disciplined risk and expense management, and prioritizing commitment to its customers’ values. The bank released a climate report committing to Net Zero emissions by 2045 and has implemented multiple strategies and policies aligning with its ESG goals."
  },
  "products_and_services": [
    {
      "product_service_name": "Commercial Banking",
      "summary": "Offers banking solutions for advocacy-based non-profits, social welfare organizations, labor unions, political organizations, and socially responsible businesses.",
      "details": "Provides a suite of commercial banking products and services, including C&I loans, CRE loans, multifamily loans, and commercial deposit products like non-interest-bearing and interest-bearing accounts. Caters to organizations focused on social impact and positive change. Specialty lending includes financing for owner-occupied union facilities, loans to affordable housing construction funds, and loans for commercial solar deployment."
    },
    {
      "product_service_name": "Trust and Investment Management",
      "summary": "Provides trust, custody, and investment management services, asset safekeeping, and a range of investment products.",
      "details": "Offers custody services such as asset safekeeping, corporate actions, income collections, proxy services, account transition, asset transfers, and conversion management. Investment management includes both index and actively-managed solutions spanning equity, fixed-income, real estate assets and alternative investment strategies. Investment strategies are tailored to align with client values, emphasizing strong corporate governance and ESG factors."
    },
    {
      "product_service_name": "Consumer Banking",
      "summary": "Provides retail banking services including deposit products, residential mortgage loans, and online banking.",
      "details": "Offers a range of consumer deposit products, including checking accounts, savings accounts, money market accounts, and certificates of deposit through branch offices and a digital banking platform. Also provides residential mortgage loans and consumer loans, predominantly for residential solar installations. Online banking and bill payment services, safe deposit box rentals, and debit/ATM card services are also offered."
    },
    {
      "product_service_name": "Residential Real Estate Loans",
      "summary": "Offers mortgage loans secured by one-to-four family dwellings, primarily within their geographic markets.",
      "details": "Provides residential loans secured by first liens on one-to-four family homes, including principal residences, second homes, and investment properties. Also includes affinity mortgage programs for members of certain commercial customers, like SEIU and AFT. The portfolio also includes purchased one-to-four family loans."
    },
    {
      "product_service_name": "Multifamily and CRE Loans",
      "summary": "Provides loans secured by multifamily and commercial real estate properties, mainly in the New York metropolitan area.",
      "details": "Offers multifamily loans, predominantly for rent-stabilized buildings in New York, and CRE loans on office buildings, retail centers, industrial facilities, mixed-use buildings, and education centers. Employs stringent underwriting guidelines for LTV and debt service coverage ratios to mitigate credit and concentration risk."
    }
  ],
  "risk_factors": [
    {
      "risk_factor_title": "Economic Conditions",
      "summary": "Economic downturns, inflation, and global events can hurt borrowers, lower asset values, and increase loan defaults, impacting the value of loans and investments.",
      "details": "Unfavorable economic conditions, driven by factors like inflation, geopolitical tensions (e.g., Ukraine, Israel-Hamas), and rising interest rates, can negatively affect borrowers' ability to repay loans, especially those secured by real estate. Declines in real estate value and sales volumes and rising unemployment also increase delinquencies and reduce demand for products/services, potentially harming capital, liquidity, and financial condition."
    },
    {
      "risk_factor_title": "Interest Rate Risk",
      "summary": "Changes in interest rates could reduce net interest income and asset values, impacting earnings and capital levels, and overall financial results.",
      "details": "A significant portion of assets and liabilities are subject to interest rate fluctuations. Mismatched interest rate sensitivities could lead to lower net interest income if rates move adversely. Rising rates may reduce loan demand and repayment ability, while falling rates could increase prepayments and deposit competition. Failure to predict/prepare for these changes could harm earnings and capital."
    },
    {
      "risk_factor_title": "Liquidity Risk",
      "summary": "Inability to meet deposit outflows and debt obligations could hurt financial condition. Recent bank failures and regulatory scrutiny heighten this risk.",
      "details": "Access to adequate funding is crucial. Downturns, credit market issues, or adverse regulatory actions could impair liquidity. Large deposit withdrawals from political or labor union clients, as well as broader concerns from the market, especially regarding uninsured deposits, compound this risk. Failure to maintain liquidity could lead to asset sales at a loss or higher-cost borrowings, hurting profitability and potentially triggering stricter regulatory requirements. Increased regulatory scrutiny of capital levels, deposit concentrations, liquidity, and risk management could adversely affect business, results of operations, or financial condition"
    },
    {
      "risk_factor_title": "Credit Risk Management",
      "summary": "Failure to effectively manage credit risk could lead to loan defaults, foreclosures, and increased charge-offs, harming our net income.",
      "details": "As a lender, there's a risk that borrowers won't repay loans, and collateral may be insufficient. Maintaining disciplined underwriting standards is crucial. Weakening standards due to competitive pressure, employee negligence, or failure to adapt to changing conditions could result in increased loan defaults, foreclosures, and a need for higher credit loss allowances, which impacts profitability."
    },
    {
      "risk_factor_title": "Cybersecurity Breaches",
      "summary": "A failure in security systems could disrupt business, leak sensitive information, damage reputation, increase costs, and cause losses.",
      "details": "Operations rely on secure data processing. Breaches can occur through internal or external attacks. Increased criminal activity, vulnerabilities in third-party tech, and political instability heighten risks. Breaches could result in losses, customer loss, reputational damage, legal liability, and regulatory penalties, with material adverse effects."
    },
    {
      "risk_factor_title": "Commercial Real Estate Market Conditions",
      "summary": "Adverse conditions in the commercial real estate market could increase delinquencies and losses in the loan porfolio.",
      "details": "Commercial real estate loans have greater risks than residential loans. Conditions in the commercial real estate market or the economy or changes in government regulations may affect repayment of such loans. The COVID-19 pandemic has also been a catalyst for the evolution of various remote work options which could impact the long-term performance of some types of office properties within our commercial real estate portfolio. Failures in risk management policies, procedures and controls could adversely affect our ability to manage this portfolio going forward and could result in an increased rate of delinquencies in, and increased losses from, this portfolio."
    },
    {
      "risk_factor_title": "Regulatory Changes",
      "summary": "Extensive regulation of the banking industry, including potential future changes, could restrict activities and hurt financial results.",
      "details": "The company operates in a heavily regulated industry, subject to examination and supervision by federal and state agencies. Compliance is costly and restricts some activities. Failure to comply with applicable laws, regulations, or policies could result in sanctions, penalties, or reputational damage, all of which could have a material adverse effect on our business, financial condition or results of operations."
    },
    {
      "risk_factor_title": "Reliance on Key Personnel",
      "summary": "Loss of executive officers or key employees could disrupt strategy execution.",
      "details": "Continued success depends on executive officers/key employees and the ability to attract/retain qualified personnel. Competition is intense. Losing key personnel could disrupt business (customer relations, market knowledge) due to the difficulty of finding replacements. Leadership transitions can disrupt business, divert management's attention, and deteriorate morale."
    },
    {
      "risk_factor_title": "Reliance on Third Parties",
      "summary": "Operational and regulatory risks could rise from third-party relationships. The new guidelines may pose operational, compliance, and strategic risks.",
      "details": "The use of third parties may pose operational, compliance, and strategic risks to banks. Banks must implement controls to ensure that third parties perform their activities in compliance with applicable laws and regulations. New agencies issued “Interagency Guidance on Third-Party Relationships: Risk Management”, which requires banks to “analyze the risks associated with each third-party relationship and to calibrate its risk management processes.”"
    },
    {
      "risk_factor_title": "Concentration in Metropolitan Areas",
      "summary": "Operations are mainly in NYC, D.C., and San Francisco. Economic decline or disruptive events in these areas could severely impact the company.",
      "details": "Success depends on the economic health of these regions. Terrorist attacks or major events could disrupt operations, impacting clients' ability to do business and potentially causing loan losses. Adverse economic conditions here could reduce growth, affect loan repayments, and destabilize deposit funding."
    },
    {
      "risk_factor_title": "Competition",
      "summary": "Strong competition from other banks, financial institutions, and wealth/investment firms could hurt our banking business.",
      "details": "The banking business is highly competitive. Customers’ preferences and expectations continue to evolve, technology has lowered barriers to entry and made it possible for banks to expand their geographic reach and for Fintech to offer products and services traditionally provided by banks. Technological changes also impact the ability to compete. Customer loyalty can be easily influenced by a competitor’s products. "
    },
    {
      "risk_factor_title": "Allowance for Credit Losses",
      "summary": "If the company has an insufficient allowance for credit losses, our financial condition and results of operations may be adversely affected.",
      "details": "The company maintains an allowance for credit losses that represents management’s judgment of current expected credit losses and risks inherent in our loan portfolio. The determination of the appropriate level of the ACL is inherently highly subjective and requires us to make significant estimates of and assumptions regarding current credit risks and future trends, all of which may undergo material changes. If, as a result of general economic conditions, there is a decrease in asset quality or growth in the loan portfolio, our management determines that additional increases in ACL are necessary, we may incur additional expenses which will reduce our net income, and our business, results of operations or financial condition may be materially and adversely affected."
    },
    {
      "risk_factor_title": "Fraud",
      "summary": "Increased losses from many forms of fraud, despite increased spending on systems and controls to detect and prevent fraud.",
      "details": "Fraudulent activity has taken many forms ranging from check fraud, mechanical devices attached to ATM machines, social engineering and phishing attacks to obtain personal information The increased sophistication of fraud activity will result in continued ongoing investments in the future to prevent or detect these fraudulent activities; however, these investments may prove insufficient and fraudulent activity could result in losses to us or our customers; loss of business and/or customers."
    },
    {
      "risk_factor_title": "Climate Change and Environmental Sustainability",
      "summary": "Physical impacts of climate change may have an effect on business operations which could adversely affect our financial condition and results of operations.",
      "details": "There is an increasing concern over climate-related risks and material environmental sustainability on the impacts of business operations, asset quality, and earnings. The risks related to the physical impacts of climate change include acute risks which are event-driven and chronic physical risks which are long-term global impacts from rising average temperature and sea levels. Any of these events could disrupt the reliability of our operations and those of our customers, and third party vendors and suppliers. "
    },
    {
      "risk_factor_title": "Multifamily Real Estate Lending in NYC",
      "summary": "Changes in NY rent regulation could impair collateral value and impact multi-family loans.",
      "details": "The Housing Stability and Tenant Protection Act of 2019 limits landlords' ability to increase rents on rent-regulated apartments and makes it harder to convert them to market-rate, potentially impairing the value of collateral securing multifamily loans."
    },
    {
      "risk_factor_title": "ESG Litigation and Compliance Risk",
      "summary": "Claims that our ESG products are misleading could damage reputation and financial performance.",
      "details": "The ESG sector has become subject to heightened regulatory scrutiny for potentially misleading claims and poor controls. Recent probes have shown that there has been a significant rise in climate-related probes and litigation, including greenwashing claims, against banks. Allegations that our ESG products contain claims that have misled investors or consumers, even if ultimately unfounded, may fundamentally damage our reputation and our financial performance."
    },
    {
      "risk_factor_title": "Trust and Investment Management",
      "summary": "Economic and market shifts could impact ability to attract investments. The investment contracts are terminable without cause and on relatively short notice.",
      "details": "The performance of the trust and investment management business may be negatively impacted by changes in general economic and market conditions. Our investment management contracts with our clients are typically terminable by the client without cause upon less than 30 days’ notice. Short term declines in market performance can result from factors outside our control such as adverse changes in regional market conditions or the poor performance of investment recommendations."
    },
    {
      "risk_factor_title": "Capital Requirements",
      "summary": "Potential for more stringent capital requirements to limit lending, acquisitions, and dividends.",
      "details": "Failure to meet minimum capital requirements could result in regulatory actions. Basel III endgame rules (proposed) could impose even higher requirements. This could limit lending, deposit growth, acquisitions, and capital distributions, potentially lowering return on equity."
    },
    {
      "risk_factor_title": "PACE Financing Risks",
      "summary": "We are exposed to risk related to PACE financing. PACE financing programs variations between each state’s programs may expose us to increased compliance costs and risks.",
      "details": "PACE financing is a means of financing energy-efficient upgrades or the installation of renewable energy sources for commercial, industrial and residential properties that are repaid over a selected term through property tax assessments. In addition, CFPB is contemplating regulations which we may be exposed to increased compliance and regulatory risks related to new residential PACE assessments. If we fail to comply with any final rules adopted by the CFPB, we may face reputational and litigation risks with respect to our PACE assessments."
    },
    {
      "risk_factor_title": "Accounting Changes and Estimates",
      "summary": "Changes in accounting policies or standards could materially impact financial reporting and judgments which may not accurately predict future events.",
      "details": "The FASB has made many recent changes to Financial accounting and reporting standards. As a result of these changes, the company could be required to change certain of the assumptions or estimates used in preparing financial statements. Differences in opinion in financial reporting could result in materially different results than would have been reported under a different alternative."
    },
    {
      "risk_factor_title": "Growth Strategy Execution",
      "summary": "Inability to implement growth or manage costs could lower earnings.",
      "details": "There is no assurance that we will be able to continue to grow and to be profitable in future periods because it requires increasing loans, assets, and deposits while following underwriting standards and by maintaining capital at all times. Failure to manage growth or expand into new markets could harm business."
    },
    {
      "risk_factor_title": "Common Stock Dilution",
      "summary": "Issuing more shares will dilute ownership and potentially lower the share price.",
      "details": "We may issue additional shares in the future (equity compensation, acquisitions, financings). This would dilute existing shareholders' ownership and could decrease the value of common stock."
    },
    {
      "risk_factor_title": "Banking Sector Uncertainty",
      "summary": "General market perception of banking could impact shares of common stock.",
      "details": "Recent bank failures have negatively impacted the price of securities issued by financial institutions. Ongoing stress in the banking sector could adversely impact the market price of our common stock and our business, financial condition and results of operations. We cannot predict if investors will find our common stock less attractive as a result of these market stresses."
    },
    {
      "risk_factor_title": "New Business Lines/Products",
      "summary": "Substantial risks and uncertainties for new lines of business, products, product enhancements and services.",
      "details": "May implement new lines of business or offer new products or enhancements. There are substantial risks and uncertainties associated with these efforts, particularly in instances in which the markets are not fully developed. External factors such as compliance regulations or market preferences may also affect the implementation of a new line of business or service."
    },
    {
      "risk_factor_title": "BSA/Anti-Money Laundering Compliance",
      "summary": "Failure to comply with anti-money laundering laws could result in fines and restrictions.",
      "details": "The BSA, PATRIOT Act requires maintaining anti-money laundering programs and filing reports. Non-compliance could lead to fines, regulatory actions, and reputational damage."
    },
    {
      "risk_factor_title": "Community Reinvestment Act (CRA)",
      "summary": "Fair lending law violations may impact reputation, business, and financial results.",
      "details": "Private parties may also have the ability to challenge an institution’s performance under fair lending laws in private class action litigation. A successful challenge to our performance under the fair lending laws and regulations could adversely impact our rating under the CRA and result in a wide variety of sanctions, including the required payment of damages and civil money penalties, injunctive relief, imposition of restrictions on merger and acquisitions and expansion activity, which could negatively impact our reputation, business, financial condition and results of operations."
    },
    {
      "risk_factor_title": "Worker's United Related Parties",
      "summary": "Control of a large percentage of common stock. Transfers of our common stock owned by the Workers United Related Parties could adversely impact your rights as a stockholder.",
      "details": "Significant stockholders will have a greater ability than our other stockholders to influence the election of directors and the potential outcome of other matters submitted to a vote of our stockholders The interests of these investors could conflict with the interests of our other stockholders, and any future transfer by these investors of their shares of common stock to other investors who have different business objectives could adversely affect our business, results of operations, financial condition, prospects or the market value of our common stock."
    },
    {
      "risk_factor_title": "Reputation Risk",
      "summary": "Poor public relations could affect ability to attract investments. As a Certified B CorporationTM we must maintain corporate and ESG practices.",
      "details": "We are a Certified B CorporationTM, and our reputation could be harmed if we lose that status or are perceived as no longer committed to B Lab's standards. Stockholder activism could cause increased scrutiny over environmental, social and corporate governance activities. Defense of our reputation and trademarks could result in costs adversely affecting our business."
    },
    {
      "risk_factor_title": "Dependence on Information Technology and Telecommunications Systems",
      "summary": "System issues and interruptions can affect operations negatively.",
      "details": "Our reliance on third-party telecommunications platforms and mobile/online baking is a weakness. Systems failures could harm reputation and negatively affect business and profitability. Cyber-attacks/breaches also remain a constant threat. Joint final rule requires FDIC-supervised banks to report certain incidents to their case manager and also requires covered bank service providers to promptly notify their FDIC-supervised bank customer when the service provider determines that it has experienced a notification incident."
    },
    {
      "risk_factor_title": "Failure of Internal Controls",
      "summary": "Failure to maintain effective internal controls could result in misstatements in our consolidated financial statements.",
      "details": "A failure in our internal controls could have a significant negative impact not only on our earnings, but also on the perception that customers, regulators and investors may have of us. Any failure to maintain internal controls over financial reporting, or any difficulties that we may encounter in such maintenance, could result in significant deficiencies or material weaknesses, result in material misstatements in our consolidated financial statements"
    },
    {
      "risk_factor_title": "Solar Loans",
      "summary": "We are exposed to higher credit risk due to our solar loans.",
      "details": "If a client defaults on solar loan, we may be unsuccessful in our efforts to collect the amount of the loan. We are limited in our ability to collect on these loans if a client is unwilling or unable to repay them. Defaults on solar loan is detrimental to our business."
    },
    {
      "risk_factor_title": "Defined Benefit Pension Plan",
      "summary": "Subject to substantial cash funding requirements in the future.",
      "details": "The company is required to make contributions to the Consolidated Retirement Fund, a multi-employer pension plan that covers both unionized and non-unionized employees. Obligation may be impacted by the funding status of the plan, the plan’s investment performance, changes in the participant demographics, financial stability of contributing employers and changes in actuarial assumptions."
    },
    {
      "risk_factor_title": "Trade Policies and Global Politics",
      "summary": "Changes in trade policies and international trade agreements may adversely impact our business.",
      "details": "There have been, and may be in the future, changes with respect to U.S. and international trade policies legislation tariffs, embargoes and other trade restrictions. A lot of this stems from tensions between US and China and may lead to sanctions and trade restrictions. The results of Russia’s invasion of Ukraine may also lead to material financial and economic sanctions."
    },
    {
      "risk_factor_title": "Ability to Pay Dividends on Common Stock",
      "summary": "Dividends are not assured and are subject to regulatory and Bank ability to pay restrictions.",
      "details": "The ability to make dividend payments on common stock depends primarily on federal regulation and the ability to receive dividends and other distribution from the Bank. The profitability of the bank is subject to fluctuating cost and availability of money, changes in interest rates and in economic conditions."
    },
    {
      "risk_factor_title": "Reliance on Customer Information",
      "summary": "The accuracy and completeness of information about customers and counterparties is very important.",
      "details": "In deciding whether to extend credit or enter into other transactions, we depend on the accuracy and completeness of the financial statements and credit reports of our customers and business entities."
    },
    {
      "risk_factor_title": "Labor Difficulties",
      "summary": "Employee union presence could increase costs and operational limitations.",
      "details": "Approx. 21% of employees are in unions. Future work stoppages may occur impacting operations. Union activities may increase labor costs and limit flexibility. Complaints and proceedings by unions or employees could negatively impact results. Negotiating bargaining agreements could divert management attention."
    },
    {
      "risk_factor_title": "Costs of Litigation",
      "summary": "Litigation costs can harm financial condition and reputation.",
      "details": "We may be involved in litigation. Costs may not be fully covered by insurance and can affect reputation. Unfavorable judgments or settlements exceeding coverage could have a material adverse effect."
    }
  ],
  "strategies_and_future_plans": [
    {
      "future_strategy_focus_headline": "Deposit-Led Organic Growth",
      "summary": "The primary goal is to grow high quality, low-cost core deposits by developing organic relationships with target customers. Success will be achieved through personalized service and customized solutions.",
      "management_quote": "Our growth has been achieved by providing relationship-based, personalized-service and customized solutions."
    },
    {
      "future_strategy_focus_headline": "Prudent Asset Allocation",
      "summary": "The company will prudently manage excess liquidity to optimize risk-adjusted returns. Lending strategy includes real estate, C&I loans, government-guaranteed loans and mission-aligned solar panel installations.",
      "management_quote": "Our business model gives us access to excess liquidity, which we intend to prudently manage to optimize risk-adjusted returns."
    },
    {
      "future_strategy_focus_headline": "Geographic Expansion",
      "summary": "Amalgamated intends to strategically expand into new markets with a large base of socially responsible organizations and individuals. They will continue evaluating opportunities in large metropolitan areas.",
      "management_quote": "We intend to consider strategic expansions into new markets that have a large constituency of socially responsible organizations and individuals."
    },
    {
      "future_strategy_focus_headline": "Grow Trust & Investment Management",
      "summary": "The company is committed to strong client relationships and understanding client goals. They offer a broad range of index and actively-managed funds. Invesco is a key partner for this growth.",
      "management_quote": "We are committed to fostering strong client relationships and unparalleled understanding of our clients’ goals and objectives."
    }
  ]
}